CSI API ETABS v1
cDetailing.GetDetailedColumnStacks Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedColumnStacks(
	ref int NumberItems,
	ref string[] ColumnStackIDs
)
Function GetDetailedColumnStacks (
	ByRef NumberItems As Integer,
	ByRef ColumnStackIDs As String()
) As Integer
Dim instance As cDetailing
Dim NumberItems As Integer
Dim ColumnStackIDs As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedColumnStacks(NumberItems,
	ColumnStackIDs)
int GetDetailedColumnStacks(
	int% NumberItems,
	array<String^>^% ColumnStackIDs
)
abstract GetDetailedColumnStacks :
        NumberItems : int byref *
        ColumnStackIDs : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
ColumnStackIDs
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace